LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>STSINT3</name>
                    <displayName>STSINT3</displayName>
                    <description>FIFO status and interrupt register 3</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <field>
                            <name>FEFLG</name>
                            <description>FIFO Empty Flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IFEDEN</name>
                            <description>Interrupt Falling Edge Detection Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLDEN</name>
                            <description>Interrupt High-Level Detection Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREDEN</name>
                            <description>Interrupt Rising Edge Detection Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IFEFLG</name>
                            <description>Interrupt Falling Edge Generate Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLFLG</name>
                            <description>Interrupt High-Level Generate Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREFLG</name>
                            <description>Interrupt Rising Edge Generate Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMSTIM3</name>
                    <displayName>CMSTIM3</displayName>
                    <description>Common memory space timing register 3</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Common Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Common Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Common Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Common Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMSTIM3</name>
                    <displayName>AMSTIM3</displayName>
                    <description>Attribute memory space timing register
 3</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Attribute Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Attribute Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Attribute Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Attribute Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCRS3</name>
                    <displayName>ECCRS3</displayName>
                    <description>ECC result register 3</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCRS</name>
                            <description>ECC result</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL4</name>
                    <displayName>CTRL4</displayName>
                    <description>PC Card/NAND Flash control register 4</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <fields>
                        <field>
                            <name>ECCPSCFG</name>
                            <description>ECC Page Size Configure</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>A2RDCFG</name>
                            <description>ALE To RE Delay Configure</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>C2RDCFG</name>
                            <description>CLE To RE Delay Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ECCEN</name>
                            <description>ECC Computation Logic Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBWIDCFG</name>
                            <description>Databus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>PC Card/NAND Flash Memory Bank Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITFEN</name>
                            <description>PC Card/NANDFlash Wait Feature Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STSINT4</name>
                    <displayName>STSINT4</displayName>
                    <description>FIFO status and interrupt register 4</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <field>
                            <name>FEFLG</name>
                            <description>FIFO Empty Flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IFEDEN</name>
                            <description>Interrupt Falling Edge Detection Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLDEN</name>
                            <description>Interrupt High-Level Detection Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREDEN</name>
                            <description>Interrupt Rising Edge Detection Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IFEFLG</name>
                            <description>Interrupt Falling Edge Generate Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLFLG</name>
                            <description>Interrupt High-Level Generate Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREFLG</name>
                            <description>Interrupt Rising Edge Generate Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMSTIM4</name>
                    <displayName>CMSTIM4</displayName>
                    <description>Common memory space timing register 4</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Common Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Common Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Common Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Common Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMSTIM4</name>
                    <displayName>AMSTIM4</displayName>
                    <description>Attribute memory space timing register
 4</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Attribute Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Attribute Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Attribute Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Attribute Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IOSTIM4</name>
                    <displayName>IOSTIM4</displayName>
                    <description>I/O space timing register 4</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZ</name>
                            <description>I/O x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLD</name>
                            <description>I/O x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAIT</name>
                            <description>I/O x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SET</name>
                            <description>I/O x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM1</name>
                    <displayName>WRTTIM1</displayName>
                    <description>SRAM/NOR-Flash write timing registers 1</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATLATCFG</name>
                            <description>Data latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock divide ratio (for CLK signal Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM2</name>
                    <displayName>WRTTIM2</displayName>
                    <description>SRAM/NOR-Flash write timing registers 2</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATLATCFG</name>
                            <description>Data latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock divide ratio (for CLK signal Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
