LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RNG</name>
            <description>Random number generator</description>
            <groupName>RNG</groupName>
            <baseAddress>0x50060800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FPU</name>
                <description>FPU interrupt</description>
                <value>81</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>Interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGEN</name>
                            <description>Random number generator enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSINT</name>
                            <description>Seed error interrupt status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKERINT</name>
                            <description>Clock error interrupt status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSCSTS</name>
                            <description>Seed error current status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLKERCSTS</name>
                            <description>Clock error current status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATARDY</name>
                            <description>Data ready</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Random data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>HASH</name>
            <description>Hash processor</description>
            <groupName>HASH</groupName>
            <baseAddress>0x50060400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>HASH_RNG</name>
                <description>Hash and Rng global interrupt</description>
                <value>80</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LKEYSEL</name>
                            <description>Long key selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DINNEMPT</name>
                            <description>DIN not empty</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WNUM</name>
                            <description>Number of words already
              pushed</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALGSEL</name>
                            <description>Algorithm selection</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODESEL</name>
                            <description>Mode selection</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTYPE</name>
                            <description>Data type selection</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMAEN</name>
                            <description>DMA enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INITCAL</name>
                            <description>Initialize message digest
              calculation</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INDATA</name>
                    <displayName>INDATA</displayName>
                    <description>data input register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INDATA</name>
                            <description>Data input</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>START</name>
                    <displayName>START</displayName>
                    <description>start register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIGCAL</name>
                            <description>Digest calculation</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>LWNUM</name>
                            <description>Number of valid bits in the last word of
              the message</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIG0</name>
                    <displayName>DIG0</displayName>
                    <description>digest registers</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIG0</name>
                            <description>DIG0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIG1</name>
                    <displayName>DIG1</displayName>
                    <description>digest registers</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIG1</name>
                            <description>DIG1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIG2</name>
                    <displayName>DIG2</displayName>
                    <description>digest registers</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIG2</name>
                            <description>DIG2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIG3</name>
                    <displayName>DIG3</displayName>
                    <description>digest registers</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIG3</name>
                            <description>DIG3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIG4</name>
                    <displayName>DIG4</displayName>
                    <description>digest registers</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIG4</name>
                            <description>DIG4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT</name>
                    <displayName>INT</displayName>
                    <description>interrupt enable register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCALC</name>
                            <description>Digest calculation completion interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INDATA</name>
                            <description>Data input interrupt
              enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>BUSY</name>
                            <description>Busy bit</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMA</name>
                            <description>DMA Status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DCALCINT</name>
                            <description>Digest calculation completion interrupt
              status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INDATAINT</name>
                            <description>Data input interrupt
              status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP0</name>
                    <displayName>CTSWAP0</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0xF8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP0</name>
                            <description>CTSWAP0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP1</name>
                    <displayName>CTSWAP1</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0xFC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP1</name>
                            <description>CTSWAP1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP2</name>
                    <displayName>CTSWAP2</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP2</name>
                            <description>CTSWAP2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP3</name>
                    <displayName>CTSWAP3</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP3</name>
                            <description>CTSWAP3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP4</name>
                    <displayName>CTSWAP4</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP4</name>
                            <description>CTSWAP4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP5</name>
                    <displayName>CTSWAP5</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP5</name>
                            <description>CTSWAP5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP6</name>
                    <displayName>CTSWAP6</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP6</name>
                            <description>CTSWAP6</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP7</name>
                    <displayName>CTSWAP7</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP7</name>
                            <description>CTSWAP7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP8</name>
                    <displayName>CTSWAP8</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP8</name>
                            <description>CTSWAP8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
