LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>CTSWAP9</name>
                    <displayName>CTSWAP9</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP9</name>
                            <description>CTSWAP9</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP10</name>
                    <displayName>CTSWAP10</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP10</name>
                            <description>CTSWAP10</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP11</name>
                    <displayName>CTSWAP11</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x124</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP11</name>
                            <description>CTSWAP11</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP12</name>
                    <displayName>CTSWAP12</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x128</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP12</name>
                            <description>CTSWAP12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP13</name>
                    <displayName>CTSWAP13</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x12C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP13</name>
                            <description>CTSWAP13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP14</name>
                    <displayName>CTSWAP14</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP14</name>
                            <description>CTSWAP14</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP15</name>
                    <displayName>CTSWAP15</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x134</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP15</name>
                            <description>CTSWAP15</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP16</name>
                    <displayName>CTSWAP16</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x138</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP16</name>
                            <description>CTSWAP16</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP17</name>
                    <displayName>CTSWAP17</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x13C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP17</name>
                            <description>CTSWAP17</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP18</name>
                    <displayName>CTSWAP18</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP18</name>
                            <description>CTSWAP18</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP19</name>
                    <displayName>CTSWAP19</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x144</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP19</name>
                            <description>CTSWAP19</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP20</name>
                    <displayName>CTSWAP20</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x148</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP20</name>
                            <description>CTSWAP20</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP21</name>
                    <displayName>CTSWAP21</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x14C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP21</name>
                            <description>CTSWAP21</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP22</name>
                    <displayName>CTSWAP22</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP22</name>
                            <description>CTSWAP22</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP23</name>
                    <displayName>CTSWAP23</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x154</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP23</name>
                            <description>CTSWAP23</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP24</name>
                    <displayName>CTSWAP24</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP24</name>
                            <description>CTSWAP24</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP25</name>
                    <displayName>CTSWAP25</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x15C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP25</name>
                            <description>CTSWAP25</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP26</name>
                    <displayName>CTSWAP26</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x160</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP26</name>
                            <description>CTSWAP26</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP27</name>
                    <displayName>CTSWAP27</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x164</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP27</name>
                            <description>CTSWAP27</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP28</name>
                    <displayName>CTSWAP28</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP28</name>
                            <description>CTSWAP28</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP29</name>
                    <displayName>CTSWAP29</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x16C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP29</name>
                            <description>CTSWAP29</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP30</name>
                    <displayName>CTSWAP30</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP30</name>
                            <description>CTSWAP30</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP31</name>
                    <displayName>CTSWAP31</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x174</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP31</name>
                            <description>CTSWAP31</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP32</name>
                    <displayName>CTSWAP32</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x178</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP32</name>
                            <description>CTSWAP32</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP33</name>
                    <displayName>CTSWAP33</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x17C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP33</name>
                            <description>CTSWAP33</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP34</name>
                    <displayName>CTSWAP34</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP34</name>
                            <description>CTSWAP34</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP35</name>
                    <displayName>CTSWAP35</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP35</name>
                            <description>CTSWAP35</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP36</name>
                    <displayName>CTSWAP36</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x188</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP36</name>
                            <description>CTSWAP36</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP37</name>
                    <displayName>CTSWAP37</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x18C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP37</name>
                            <description>CTSWAP37</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP38</name>
                    <displayName>CTSWAP38</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x190</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP38</name>
                            <description>CTSWAP38</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP39</name>
                    <displayName>CTSWAP39</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x194</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP39</name>
                            <description>CTSWAP39</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
