LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>CTSWAP40</name>
                    <displayName>CTSWAP40</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x198</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP40</name>
                            <description>CTSWAP40</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP41</name>
                    <displayName>CTSWAP41</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x19C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP41</name>
                            <description>CTSWAP41</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP42</name>
                    <displayName>CTSWAP42</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP42</name>
                            <description>CTSWAP42</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP43</name>
                    <displayName>CTSWAP43</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP43</name>
                            <description>CTSWAP43</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP44</name>
                    <displayName>CTSWAP44</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1A8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP44</name>
                            <description>CTSWAP44</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP45</name>
                    <displayName>CTSWAP45</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP45</name>
                            <description>CTSWAP45</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP46</name>
                    <displayName>CTSWAP46</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP46</name>
                            <description>CTSWAP46</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP47</name>
                    <displayName>CTSWAP47</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP47</name>
                            <description>CTSWAP47</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP48</name>
                    <displayName>CTSWAP48</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP48</name>
                            <description>CTSWAP48</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP49</name>
                    <displayName>CTSWAP49</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1BC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP49</name>
                            <description>CTSWAP49</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSWAP50</name>
                    <displayName>CTSWAP50</displayName>
                    <description>context swap registers</description>
                    <addressOffset>0x1C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTSWAP50</name>
                            <description>CTSWAP50</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
