LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="DMA2">
            <name>DMA1</name>
            <baseAddress>0x40026000</baseAddress>
            <interrupt>
                <name>DMA1_STR0</name>
                <description>DMA1 Stream 0 global interrupt</description>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR1</name>
                <description>DMA1 Stream 1 global interrupt</description>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR2</name>
                <description>DMA1 Stream 2 global interrupt</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR3</name>
                <description>DMA1 Stream 3 global interrupt</description>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR4</name>
                <description>DMA1 Stream 4 global interrupt</description>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR5</name>
                <description>DMA1 Stream 5 global interrupt</description>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR6</name>
                <description>DMA1 Stream 6 global interrupt</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>DMA1_STR7</name>
                <description>DMA1 Stream 7 global interrupt</description>
                <value>47</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>RCM</name>
            <description>Reset and clock control</description>
            <groupName>RCM</groupName>
            <baseAddress>0x40023800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCM</name>
                <description>RCM global interrupt</description>
                <value>5</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>clock control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000083</resetValue>
                    <fields>
                        <field>
                            <name>PLL2RDYFLG</name>
                            <description>PLLI2S clock ready flag</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL2EN</name>
                            <description>PLLI2S enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL1RDYFLG</name>
                            <description>Main PLL (PLL) clock ready
              flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLL1EN</name>
                            <description>Main PLL (PLL) enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSSEN</name>
                            <description>Clock security system
              enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSEBCFG</name>
                            <description>HSE clock bypass</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSERDYFLG</name>
                            <description>HSE clock ready flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSEEN</name>
                            <description>HSE clock enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSICAL</name>
                            <description>Internal high-speed clock
              calibration</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSITRM</name>
                            <description>Internal high-speed clock
              trimming</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSIRDYFLG</name>
                            <description>Internal high-speed clock ready
              flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSIEN</name>
                            <description>Internal high-speed clock
              enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLL1CFG</name>
                    <displayName>PLL1CFG</displayName>
                    <description>PLL configuration register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x24003010</resetValue>
                    <fields>
                        <field>
                            <name>PLLD3</name>
                            <description>Main PLL (PLL) division factor for USB
              OTG FS, SDIO and random number generator
              clocks</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLD2</name>
                            <description>Main PLL (PLL) division factor for USB
              OTG FS, SDIO and random number generator
              clocks</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLD1</name>
                            <description>Main PLL (PLL) division factor for USB
              OTG FS, SDIO and random number generator
              clocks</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLD0</name>
                            <description>Main PLL (PLL) division factor for USB
              OTG FS, SDIO and random number generator
              clocks</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1CLKS</name>
                            <description>Main PLL(PLL) and audio PLL (PLLI2S)
              entry clock source</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1C1</name>
                            <description>Main PLL (PLL) division factor for main
              system clock</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1C0</name>
                            <description>Main PLL (PLL) division factor for main
              system clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A8</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A7</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A6</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A5</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A4</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A3</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A2</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A1</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLL1A0</name>
                            <description>Main PLL (PLL) multiplication factor for
              VCO</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB5</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB4</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB3</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB2</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB1</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLB0</name>
                            <description>Division factor for the main PLL (PLL)
              and audio PLL (PLLI2S) input clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>clock configuration register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCO2SEL</name>
                            <description>Microcontroller clock output
              2</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO2PSC</name>
                            <description>MCO2 prescaler</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1PSC</name>
                            <description>MCO1 prescaler</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2SSEL</name>
                            <description>I2S clock selection</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCO1SEL</name>
                            <description>Microcontroller clock output
              1</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCPSC</name>
                            <description>HSE division factor for RTC
              clock</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB2PSC</name>
                            <description>APB high-speed prescaler
              (APB2)</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB1PSC</name>
                            <description>APB Low speed prescaler
              (APB1)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SDRAMPSC</name>
                            <description>SDRAM Clock Prescaler Factor
Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBPSC</name>
                            <description>AHB prescaler</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLKSWSTS1</name>
                            <description>System clock switch status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCLKSWSTS0</name>
                            <description>System clock switch status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCLKSEL1</name>
                            <description>System clock switch</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLKSEL0</name>
                            <description>System clock switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
