LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="UART4">
            <name>UART5</name>
            <baseAddress>0x40005000</baseAddress>
            <interrupt>
                <name>UART5</name>
                <description>UART5 global interrupt</description>
                <value>53</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>ADC_CCTRL</name>
            <description>ADC Common control registers</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40012300</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>ADC Common status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVRFLG3</name>
                            <description>Overrun flag of ADC3</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGCSFLG3</name>
                            <description>Regular channel Start flag of ADC
              3</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJCSFLG3</name>
                            <description>Injected channel Start flag of ADC
              3</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJEOCFLG3</name>
                            <description>Injected channel end of conversion of
              ADC 3</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOCFLG3</name>
                            <description>End of conversion of ADC 3</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDFLG3</name>
                            <description>Analog watchdog flag of ADC
              3</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVRFLG2</name>
                            <description>Overrun flag of ADC 2</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGCSFLG2</name>
                            <description>Regular channel Start flag of ADC
              2</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJCSFLG2</name>
                            <description>Injected channel Start flag of ADC
              2</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJEOCFLG2</name>
                            <description>Injected channel end of conversion of
              ADC 2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOCFLG2</name>
                            <description>End of conversion of ADC 2</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDFLG2</name>
                            <description>Analog watchdog flag of ADC
              2</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVRFLG1</name>
                            <description>Overrun flag of ADC 1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>REGCSFLG1</name>
                            <description>Regular channel Start flag of ADC
              1</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJCSFLG1</name>
                            <description>Injected channel Start flag of ADC
              1</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INJEOCFLG1</name>
                            <description>Injected channel end of conversion of
              ADC 1</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EOCFLG1</name>
                            <description>End of conversion of ADC 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDFLG1</name>
                            <description>Analog watchdog flag of ADC
              1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CCTRL</name>
                    <displayName>CCTRL</displayName>
                    <description>ADC common control register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TSVREFEN</name>
                            <description>Temperature sensor and VREFINT
              enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VBATEN</name>
                            <description>VBAT enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCPRE</name>
                            <description>ADC prescaler</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DMAMODE</name>
                            <description>Direct memory access mode for multi ADC
              mode</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DMADISSEL</name>
                            <description>DMA disable selection for multi-ADC
              mode</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SMPDEL2</name>
                            <description>Delay between 2 sampling
              phases</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADCMSEL</name>
                            <description>Multi ADC mode selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CDATA</name>
                    <displayName>CDATA</displayName>
                    <description>ADC common regular data register for dual
          and triple modes</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA2</name>
                            <description>2nd data item of a pair of regular
              conversions</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>1st data item of a pair of regular
              conversions</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
