LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>MACDBG</name>
                    <displayName>MACDBG</displayName>
                    <description>Ethernet MAC debug register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RPESTS</name>
                            <description>MAC MII Receive Protocol Engine Status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFCFCSTS</name>
                            <description>MAC Receive Frame FIFO Controller Status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RWCSTS</name>
                            <description>RX FIFO Write Controller Active Status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RRCSTS</name>
                            <description>RX FIFO Read Controller State</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXFSTS</name>
                            <description>RX FIFO full - level Status</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TPESTS</name>
                            <description>MAC MII Transmit Protocol Engine Status</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFCSTS</name>
                            <description>MAC Transmit Frame Controller Status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXPAUSED</name>
                            <description>MAC Transmitter in Pause</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRCSTS</name>
                            <description>TX FIFO Read Controller Status</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TWCSTS</name>
                            <description>TX FIFO Write Controller Status</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFSTS</name>
                            <description>TX FIFO Not Empty Status</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXSTSFSTS</name>
                            <description>TX Status FIFO Full Status</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACISTS</name>
                    <displayName>MACISTS</displayName>
                    <description>Ethernet MAC interrupt status
          register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PMTIS</name>
                            <description>PMT Interrupt Status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCIS</name>
                            <description>MMC Interrupt Status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCRXIS</name>
                            <description>MMC Receive Interrupt Status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MMCTXIS</name>
                            <description>MMC Transmit Interrupt Status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>TSIS</name>
                            <description>Timestamp Interrupt Status</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACIMASK</name>
                    <displayName>MACIMASK</displayName>
                    <description>Ethernet MAC interrupt mask
          register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PMTIM</name>
                            <description>PMT Interrupt Mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSTIM</name>
                            <description>Time Stamp Trigger Interrupt Mask</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR0L</name>
                    <displayName>MACADDR0L</displayName>
                    <description>Ethernet MAC address 0 high
          register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0010FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0H</name>
                            <description>MAC address0 high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AL1</name>
                            <description>Always 1</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACMACA0LR</name>
                    <displayName>MACMACA0LR</displayName>
                    <description>Ethernet MAC address 0 low
          register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0L</name>
                            <description>MAC Address 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR1H</name>
                    <displayName>MACADDR1H</displayName>
                    <description>Ethernet MAC address 1 high
          register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1H</name>
                            <description>MAC Address 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR1L</name>
                    <displayName>MACADDR1L</displayName>
                    <description>Ethernet MAC address1 low
          register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1L</name>
                            <description>MAC Address 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR2H</name>
                    <displayName>MACADDR2H</displayName>
                    <description>Ethernet MAC address 2 high
          register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2H</name>
                            <description>MAC Address 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR2L</name>
                    <displayName>MACADDR2L</displayName>
                    <description>Ethernet MAC address 2 low
          register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2L</name>
                            <description>MAC Address 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>31</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR3H</name>
                    <displayName>MACADDR3H</displayName>
                    <description>Ethernet MAC address 3 high
          register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3H</name>
                            <description>MAC Address 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MASKBCTRL</name>
                            <description>Mask Byte Control</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSEL</name>
                            <description>Address Select</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADDREN</name>
                            <description>Address Enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR3L</name>
                    <displayName>MACADDR3L</displayName>
                    <description>Ethernet MAC address 3 low
          register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3L</name>
                            <description>MAC Address 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
