LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>DMAINTEN</name>
                    <displayName>DMAINTEN</displayName>
                    <description>Ethernet DMA interrupt enable
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXIEN</name>
                            <description>Transmit Interrupt Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXSEN</name>
                            <description>Transmit Stopped Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXBUEN</name>
                            <description>Transmit Buffer Unavailable Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXJTOEN</name>
                            <description>Transmit Jabber Timeout Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOVFEN</name>
                            <description>Receive Overflow Interrupt Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXUNFEN</name>
                            <description>Transmit Underflow Interrupt Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXIEN</name>
                            <description>Receive Interrupt Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBUEN</name>
                            <description>Receive Buffer Unavailable Enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSEN</name>
                            <description>Receive Stopped Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXWTOEN</name>
                            <description>Receive Watchdog Timeout Enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETXIEN</name>
                            <description>Early Transmit Interrupt Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FBERREN</name>
                            <description>Fatal Bus Error Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERXIEN</name>
                            <description>Early Receive Interrupt Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AINTSEN</name>
                            <description>Abnormal Interrupt Summary Enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NINTSEN</name>
                            <description>Normal Interrupt Summary Enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAMFABOCNT</name>
                    <displayName>DMAMFABOCNT</displayName>
                    <description>Ethernet DMA missed frame and buffer
          overflow counter register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MISFCNT0</name>
                            <description>Missed Frame Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>MISFCNTOVF</name>
                            <description>Overflow Bit for Missed Frame Counter</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AMISFCNT</name>
                            <description>Application Missed Frame Counter</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>OVFCNTOVF</name>
                            <description>Overflow Bit for FIFO Overflow Counter</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMARXFLGWDT</name>
                    <displayName>DMARXFLGWDT</displayName>
                    <description>Ethernet DMA receive status watchdog timer
          register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXWDTCNT</name>
                            <description>RXFLG Watchdog Timer Count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHTXD</name>
                    <displayName>DMAHTXD</displayName>
                    <description>Ethernet DMA current host transmit
          descriptor register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTXDADDRP</name>
                            <description>Host Transmit Descriptor Address Pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHRXD</name>
                    <displayName>DMAHRXD</displayName>
                    <description>Ethernet DMA current host receive descriptor
          register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HRXDADDRP</name>
                            <description>Host Receive Descriptor Address Pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHTXBADDR</name>
                    <displayName>DMAHTXBADDR</displayName>
                    <description>Ethernet DMA current host transmit buffer
          address register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTXBADDRP</name>
                            <description>Host Transmit Buffer Address Pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMAHRXBADDR</name>
                    <displayName>DMAHRXBADDR</displayName>
                    <description>Ethernet DMA current host receive buffer
          address register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HRXBADDRP</name>
                            <description>Host Receive Buffer Address Pointer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
