LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_FS_HOST</name>
            <description>USB on the go full speed</description>
            <groupName>USB_OTG_FS</groupName>
            <baseAddress>0x50000400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>HCFG</name>
                    <displayName>HCFG</displayName>
                    <description>OTG_FS host configuration register
          (OTG_FS_HCFG)</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PHYCLKSEL</name>
                            <description>FS/LS PHY clock select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSSPT</name>
                            <description>FS- and LS-only support</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFIVL</name>
                    <displayName>HFIVL</displayName>
                    <description>OTG_FS Host frame interval
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000EA60</resetValue>
                    <fields>
                        <field>
                            <name>FIVL</name>
                            <description>Frame interval</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HFIFM</name>
                    <displayName>HFIFM</displayName>
                    <description>OTG_FS host frame number/frame time
          remaining register (OTG_FS_HFNUM)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00003FFF</resetValue>
                    <fields>
                        <field>
                            <name>FNUM</name>
                            <description>Frame number</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>FRTIME</name>
                            <description>Frame time remaining</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPTXSTS</name>
                    <displayName>HPTXSTS</displayName>
                    <description>OTG_FS_Host periodic transmit FIFO/queue
          status register (OTG_FS_HPTXSTS)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00080100</resetValue>
                    <fields>
                        <field>
                            <name>FSPACE</name>
                            <description>Periodic transmit data FIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>QSPACE</name>
                            <description>Periodic transmit request queue space
              available</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>QTOP</name>
                            <description>Top of the periodic transmit request
              queue</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HACHINT</name>
                    <displayName>HACHINT</displayName>
                    <description>OTG_FS Host all channels interrupt
          register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ACHINT</name>
                            <description>Channel interrupts</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HACHIMASK</name>
                    <displayName>HACHIMASK</displayName>
                    <description>OTG_FS host all channels interrupt mask
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ACHIMASK</name>
                            <description>Channel interrupt mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HPORTCSTS</name>
                    <displayName>HPORTCSTS</displayName>
                    <description>OTG_FS host port control and status register
          (OTG_FS_HPRT)</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCNNTFLG</name>
                            <description>Port connect status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PCINTFLG</name>
                            <description>Port connect detected</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEN</name>
                            <description>Port enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PENCHG</name>
                            <description>Port enable/disable change</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POVC</name>
                            <description>Port overcurrent active</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>POVCCHG</name>
                            <description>Port overcurrent change</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRS</name>
                            <description>Port resume</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSUS</name>
                            <description>Port suspend</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRST</name>
                            <description>Port reset</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PDLSTS</name>
                            <description>Port line status</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PP</name>
                            <description>Port power</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PTSEL</name>
                            <description>Port test control</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSPDSEL</name>
                            <description>Port speed</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH0</name>
                    <displayName>HCH0</displayName>
                    <description>OTG_FS host channel-0 characteristics
          register (OTG_FS_HCCHAR0)</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH1</name>
                    <displayName>HCH1</displayName>
                    <description>OTG_FS host channel-1 characteristics
          register (OTG_FS_HCCHAR1)</description>
                    <addressOffset>0x120</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HCH2</name>
                    <displayName>HCH2</displayName>
                    <description>OTG_FS host channel-2 characteristics
          register (OTG_FS_HCCHAR2)</description>
                    <addressOffset>0x140</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPSIZE</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>11</bitWidth>
                        </field>
                        <field>
                            <name>EDPNUM</name>
                            <description>Endpoint number</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDPDRT</name>
                            <description>Endpoint direction</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSDV</name>
                            <description>Low-speed device</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EDPTYP</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CNTSEL</name>
                            <description>Multicount</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DVADDR</name>
                            <description>Device address</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>ODDF</name>
                            <description>Odd frame</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHINT</name>
                            <description>Channel disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHEN</name>
                            <description>Channel enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
