LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_HS2</name>
            <description>USB on the go high speed</description>
            <groupName>USB_OTG_HS</groupName>
            <baseAddress>0x40040200</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x200</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USB_SWITCH</name>
                    <displayName>USB_SWITCH</displayName>
                    <description>USB Switch</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>usb_switch</name>
                            <description>USB Switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POWERON_CORE</name>
                    <displayName>POWERON_CORE</displayName>
                    <description>Power on Core</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>poweron_core</name>
                            <description>Power on Core</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_PLL_EN</name>
                    <displayName>USB_PLL_EN</displayName>
                    <description>USB PLL Enable</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>usb_pll_en</name>
                            <description>USB PLL Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SHORT_5V_ENABLE</name>
                    <displayName>SHORT_5V_ENABLE</displayName>
                    <description>VBUS Short 5V Enable</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>short_5v_enable</name>
                            <description>VBUS Short 5V Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OTG_SUSPENDM</name>
                    <displayName>OTG_SUSPENDM</displayName>
                    <description>OTG VBUS Suspend</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>otg_suspendm</name>
                            <description>OTG VBUS Suspend</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXBITSTUFFENABLE</name>
                    <displayName>TXBITSTUFFENABLE</displayName>
                    <description>TX Bit Stuff Enable</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>txbitstuffenable</name>
                            <description>TX Bit Stuff Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PLLICP_SEL_I2C</name>
                    <displayName>PLLICP_SEL_I2C</displayName>
                    <description>PLL charge current setting</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>pllicp_sel_i2c</name>
                            <description>PLL charge current setting</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSZR_CNTL_I2C</name>
                    <displayName>HSZR_CNTL_I2C</displayName>
                    <description>The DP/DM to the ground impedance setting</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x004</resetValue>
                    <fields>
                        <field>
                            <name>hszr_cntl_i2c</name>
                            <description>The DP/DM to the ground impedance setting</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SQVTH_CNTL_I2C</name>
                    <displayName>SQVTH_CNTL_I2C</displayName>
                    <description>The SQ reference voltage setting</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x01</resetValue>
                    <fields>
                        <field>
                            <name>sqvth_cntl_i2c</name>
                            <description>The SQ reference voltage setting</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SW_RREF_I2C</name>
                    <displayName>SW_RREF_I2C</displayName>
                    <description>The DP/DM output swing setting when HS
mode</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x004</resetValue>
                    <fields>
                        <field>
                            <name>sw_rref_i2c</name>
                            <description>The DP/DM output swing setting when HS
mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SW_BUF_I2C</name>
                    <displayName>SW_BUF_I2C</displayName>
                    <description>The TX driver setting</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>sw_buf_i2c</name>
                            <description>The TX driver setting</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TX2RX_T_CFG_I2C</name>
                    <displayName>TX2RX_T_CFG_I2C</displayName>
                    <description>Debug control signal</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>tx2rx_t_cfg_i2c</name>
                            <description>Debug control signal</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TEST_ANA_FAST_I2C</name>
                    <displayName>TEST_ANA_FAST_I2C</displayName>
                    <description>Debug control signal</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>test_ana_fast_i2c</name>
                            <description>Debug control signal</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_MODE_I2C</name>
                    <displayName>CLK_MODE_I2C</displayName>
                    <description>Debug control signal</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>clk_mode_i2c</name>
                            <description>Debug control signal</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_DBNCE_FLTR_BYPASS</name>
                    <displayName>USB_DBNCE_FLTR_BYPASS</displayName>
                    <description>Bypass debounce filters for avalid, bvalid,
vbusvalid, sessend, iddig signals when enabled</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00080200</resetValue>
                    <fields>
                        <field>
                            <name>usb_dbnce_fltr_bypass</name>
                            <description>Bypass debounce filters for avalid, bvalid,
vbusvalid, sessend, iddig signals when enabled</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>USB_SS_SCALEDOWN_MODE</name>
                    <displayName>USB_SS_SCALEDOWN_MODE</displayName>
                    <description>Used only in simulation</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>usb_ss_scaledown_mode</name>
                            <description>Used only in simulation</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
