LuckkMaker/apm32-ceedling-example/svd/APM32F41x.svd
                <register>
                    <name>DOEPINT3</name>
                    <displayName>DOEPINT3</displayName>
                    <description>OTG_HS device endpoint-3 interrupt
          register</description>
                    <addressOffset>0x368</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP phase done</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>OUT token received when endpoint
              disabled</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBSP</name>
                            <description>Back-to-back SETUP packets
              received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT4</name>
                    <displayName>DOEPINT4</displayName>
                    <description>OTG_HS device endpoint-4 interrupt
          register</description>
                    <addressOffset>0x388</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP phase done</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>OUT token received when endpoint
              disabled</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBSP</name>
                            <description>Back-to-back SETUP packets
              received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT5</name>
                    <displayName>DOEPINT5</displayName>
                    <description>OTG_HS device endpoint-5 interrupt
          register</description>
                    <addressOffset>0x3A8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP phase done</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>OUT token received when endpoint
              disabled</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBSP</name>
                            <description>Back-to-back SETUP packets
              received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT6</name>
                    <displayName>DOEPINT6</displayName>
                    <description>OTG_HS device endpoint-6 interrupt
          register</description>
                    <addressOffset>0x3C8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP phase done</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>OUT token received when endpoint
              disabled</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBSP</name>
                            <description>Back-to-back SETUP packets
              received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT7</name>
                    <displayName>DOEPINT7</displayName>
                    <description>OTG_HS device endpoint-7 interrupt
          register</description>
                    <addressOffset>0x3E8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP phase done</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>OUT token received when endpoint
              disabled</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXBSP</name>
                            <description>Back-to-back SETUP packets
              received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NYET</name>
                            <description>NYET interrupt</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS1</name>
                    <displayName>DOEPTRS1</displayName>
                    <description>OTG_HS device endpoint-1 transfer size
          register</description>
                    <addressOffset>0x310</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS2</name>
                    <displayName>DOEPTRS2</displayName>
                    <description>OTG_HS device endpoint-2 transfer size
          register</description>
                    <addressOffset>0x330</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS3</name>
                    <displayName>DOEPTRS3</displayName>
                    <description>OTG_HS device endpoint-3 transfer size
          register</description>
                    <addressOffset>0x350</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS4</name>
                    <displayName>DOEPTRS4</displayName>
                    <description>OTG_HS device endpoint-4 transfer size
          register</description>
                    <addressOffset>0x370</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS5</name>
                    <displayName>DOEPTRS5</displayName>
                    <description>OTG_HS device endpoint-5 transfer size
          register</description>
                    <addressOffset>0x390</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
